using System;
using System.Collections.Generic;
using System.Text;

namespace Coursework_Babych_Speech_Therapy.Model
{
    public class News
    {
        public string Topic { get; set; }
        public string ShortDescription { get; set; }
        public string Image { get; set; }

        public List<News> GetNews()
        {
            List<News> news = new List<News>()
            {
                new News(){Topic = "Поцілунки! Корисно чи ні?", Image = "kiss.jpg", ShortDescription = "Чому потрібно цілувати наших дітей?! Все дуже просто! Ось як активується наш мозок, " +
                "коли ми цілуємо наших дітей. Це перше в світі зображення від невролога з Массачусетського технологічного інституту Ребекки Сакс, отримане за допомогою МРТ, " +
                "яке показує зв'язок між матір'ю і двомісячним сином. Поцілунок викликає хімічну реакцію в мозку, включаючи викид гормону окситоцину, а саме «гормону любові», " +
                "тому що він викликає почуття прихильності. Також він активує систему винагороди мозку, що випускає допамін, який змушує нас відчувати себе добре; вазопресин, " +
                "який пов'язує матеріві діте;  та серотонін, який допомагає регулювати наш настрій. Висновок!!! Частіше цілуйте своїх дітей – це надзвичайно корисно для всіх!"},

                new News() {Topic = "Загубив нейронні зв’язки?", Image = "flashmob.jpg", ShortDescription = "Коли на носі сесія і мозок зовсім не працює! Коли потрібно вивчити багато матеріалу, " +
                "а реально часу мало! Вихід є – активізувати мозок!!! Зацікавило?! Звертайся до нас! Студенти спеціальності Спеціальна освіта. Логопедія допоможуть налагодити зв’язки і здати успішно сесію!" +
                "Як?! Просто і весело – з допомогою ритмічних вправ і музики! Не віриш! Приходь і перевір!"},

                new News() {Topic = "Любите подорожі?!", Image = "travels.png", ShortDescription = "Ви захоплені наукою? Ви не боїтеся змін? Ви енергійні та ініціативні? Ви обожнюєте дослідження? " +
                "Ви любите подорожувати?! Тоді Вам з Нами!!! Проект 'Студентський науковий SMART-туризм' розширює кордони! Запрошуємо всіх бажаючих до нашої спільноти! " +
                "Ви зможете не тільки розповісти всім про свої дослідження, але й збагатитись культурно і духовно, а головне весело і з користю провести час у колі СПРАВЖНІХ МАНДРІВНИКІВ!!!"},

                new News() {Topic = "ВАШ ВІДЕОЧАТ!", Image = "videoconf.jpg", ShortDescription = "ЦІКАВО!!!! Мозок – це не просто нейронна сітка, це сітка сіток, сітка сіток сіток. " +
                "В мозку 5,5 петабайт інформації – три мільйони годин перегляду відеоматеріалів. Триста років неперервного перегляду. " +
                "Будь пильним! Наповнюй свій відеочат корисною інформацією!"},

                new News() {Topic = "ЗІРКОВИЙ ОРАТОР", Image = "speaker.jpg", ShortDescription = "«Каша в роті»?! «Заплітається язик»?! Хвилюєтесь під час виступу? Боїтесь великої аудиторії?! " +
                "Не впевнені, що все говорите правильно?! Ми Вам допоможемо! Запишись на тренінги «Зірковий оратор». АЛЕ???? Спочатку консультація логопеда в Центрі практичної " +
                "підготовки «Логотренажер» (бул. Шамо 18/2, ауд. 321, м.т. 097 404-20-92). Все конфіденційно!!!"}
            };
            return news;
        }

    }
}